# IFC_DeleteDS

## Description
Deletes Data Sheet from object.

```pascal
FUNCTION IFC_DeleteDS(
				objectName    : STRING;
				dataSheetName : STRING): BOOLEAN;
```

```python
def vs.IFC_DeleteDS(objectName, dataSheetName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectName|STRING|   |
|dataSheetName|STRING|   |

## Version
Availability: from Vectorworks 2023.4

## Category
* IFC